---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetSpecularColor(Autodesk.Revit.DB.Color)
source: html/715cb93c-e62a-280d-0095-47950d1cce7f.htm
---
# Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetSpecularColor Method

Sets the specular color parameter of the effect instance.

## Syntax (C#)
```csharp
public void SetSpecularColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - The specular color value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null